===============================================
single attribute
===============================================

netcdf basic {
    variables:
        float a ;
        float a:attr = 1;
}

---

(dataset
  (dataset_id)
  (variables_section
    (variable_declarations
      type: (typeref
        (type))
      (variable
        name: (identifier)))
    (attribute
      type: (typeref
        (type))
      variable: (identifier)
      name: (identifier)
      value: (value
        (integer)))))

===============================================
single attribute multiple values
===============================================

netcdf basic {
    variables:
        float a ;
        float a:range = 1.0, 5.0;
}

---

(dataset
  (dataset_id)
  (variables_section
    (variable_declarations
      type: (typeref
        (type))
      (variable
        name: (identifier)))
    (attribute
      type: (typeref
        (type))
      variable: (identifier)
      name: (identifier)
      value: (value
        (float))
      value: (value
        (float)))))

===============================================
single untyped variable attribute -- known ambiguity treated as typed global attribute
===============================================

netcdf basic {
    variables:
        float a ;
        a:attr = 1;
}

---

(dataset
  (dataset_id)
  (variables_section
    (variable_declarations
      type: (typeref
        (type))
      (variable
        name: (identifier)))
    (attribute
      type: (typeref
        (derived_type
          (identifier)))
      name: (identifier)
      value: (value
        (integer)))))

===============================================
single primitive typed global attribute
===============================================

netcdf basic {
    variables:
        int :attr = 1;
}

---

(dataset
  (dataset_id)
  (variables_section
    (attribute
      type: (typeref
         (type))
      name: (identifier)
      value: (value
        (integer)))))

===============================================
single derived typed global attribute
===============================================

netcdf basic {
    variables:
        my_type :asdf = 12;
}

---

(dataset
  (dataset_id)
  (variables_section
    (attribute
      type: (typeref
        (derived_type
          (identifier)))
      name: (identifier)
      value: (value
        (integer)))))

===============================================
single global attribute (untyped)
===============================================

netcdf basic {
    variables:
        :attr = 1;
}

---

(dataset
  (dataset_id)
  (variables_section
    (attribute
      name: (identifier)
      value: (value
        (integer)))))
